04_OpenFoam/_Tut_02/OpenFOAM-14/multiphaseEuler/condenser/system/createZonesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createZonesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dryer
{
    type        box;
    zoneType    cell;
    box         (0.4 0 0) (0.6 0.2 0.2);
}

// ************************************************************************* //
